In [1]:
# Import pandas
import numpy as np
from scipy.stats import mode
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import sklearn
import os

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

### Importing the data

In [2]:
# Read in dataset
banking_df = pd.read_csv(os.getcwd()+os.sep+'Churn_Modelling.csv')
pd.set_option('display.max_columns', None)

In [3]:
# Print header
banking_df.head()
#Dimensions of the data and investigate if there are any duplicate rows
banking_df.shape

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

(10000, 14)

In [4]:
# Print info
banking_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  int64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB

In [5]:
#Uncomment only if you have pandas profiling installed

#import pandas_profiling
#pandas_profiling.ProfileReport(banking_df)

### data cleaning

In [6]:
#drop columns
banking_df = banking_df.drop(columns = ['RowNumber', 'CustomerId', 'Surname'])
banking_df.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [7]:
#change data type
#banking_df = banking_df.replace({'France' : 1, 'Spain' : 2, 'Germany' : 3})
banking_df = banking_df.replace({'Female' : 0, 'Male' : 1})
banking_df.head()
banking_df.info()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,France,0,42,2,0.00,1,1,1,101348.88,1
1,608,Spain,0,41,1,83807.86,1,0,1,112542.58,0
2,502,France,0,42,8,159660.80,3,1,0,113931.57,1
3,699,France,0,39,1,0.00,2,0,0,93826.63,0
4,850,Spain,0,43,2,125510.82,1,1,1,79084.10,0

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CreditScore      10000 non-null  int64
 1   Geography        10000 non-null  object
 2   Gender           10000 non-null  int64
 3   Age              10000 non-null  int64
 4   Tenure           10000 non-null  int64
 5   Balance          10000 non-null  float64
 6   NumOfProducts    10000 non-null  int64
 7   HasCrCard        10000 non-null  int64
 8   IsActiveMember   10000 non-null  int64
 9   EstimatedSalary  10000 non-null  float64
 10  Exited           10000 non-null  int64
dtypes: float64(2), int64(8), object(1)
memory usage: 859.5+ KB

In [19]:
#Statistics
banking_df.groupby('Geography', as_index=False).agg({"NumOfProducts": "count","Tenure": "mean"})

  Geography  NumOfProducts    Tenure
0    France           5014  5.004587
1   Germany           2509  5.009964
2     Spain           2477  5.032297

In [29]:
banking_df.groupby(['Gender', 'Exited','IsActiveMember']).mean()

                              CreditScore        Age    Tenure       Balance  \
Gender Exited IsActiveMember
0      0      0                650.082790  35.514993  5.059974  71291.080834
              1                653.850267  38.914439  4.909091  71094.793460
       1      0                648.026207  44.856552  4.966897  87748.744855
              1                644.881643  44.659420  4.874396  91292.010169
1      0      0                648.024342  35.438649  5.179831  72626.253646
              1                654.480361  39.000393  4.992537  74927.874269
       1      0                642.123050  44.909879  5.072790  95059.942461
              1                645.719626  44.897196  4.679128  91357.556386

                              NumOfProducts  HasCrCard  EstimatedSalary
Gender Exited IsActiveMember
0      0      0                    1.574316   0.705346    100958.604218
              1                    1.539572   0.703209     98878.828059
       1      0                    1.480000   0.721379    102455.642841
              1                    1.565217   0.657005    103812.932609
1      0      0                    1.539990   0.707402     99873.221028
              1                    1.532993   0.710919     99527.931033
       1      0                    1.393414   0.726170    101255.697799
              1                    1.495327   0.654206     96579.913832